1)What is pandas
## def: pandas is a python library used for data cleaning,analysis and manipulation
## works like excel but faster
## helps load clean, fliter, analyze, data
## data science, machine leaning, finance, analytics, and automating data tasks

2)importing pandas

In [2]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.3'

3)pandas data structures
series: one dimensional column
dataframe: table with rows and columns

In [4]:
s = pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [9]:
df = pd.DataFrame({
    "name":["pavan","vinay"],
    "age":[25,23]
    })
df

    name  age
0  pavan   25
1  vinay   23

4)reading csv

In [40]:
df = pd.read_csv('data1.csv')
df

         date       city  temperature  humidity condition
0  01-01-2025   hyderbad           32        32     sunny
1  02-01-2025   hyderbad           30        29      cold
2  03-01-2025   hyderbad           33        27     sunny
3  04-01-2025   hyderbad           34        29    cloudy
4  05-01-2025   hyderbad           33        33     rainy
5  06-01-2025  bangalore           28        32     rainy
6  07-01-2025  bangalore           32        29     sunny
7  08-01-2025  bangalore           29        29    cloudy
8  09-01-2025  bangalore           31        31     rainy
9  10-01-2025  bangalore           28        32    sunnyu

writing the data into files

In [37]:
df.to_csv('data1.csv',index=False)

AttributeError: 'NoneType' object has no attribute 'to_csv'

In [39]:
df

Exlploring data

In [41]:
df.head()

         date      city  temperature  humidity condition
0  01-01-2025  hyderbad           32        32     sunny
1  02-01-2025  hyderbad           30        29      cold
2  03-01-2025  hyderbad           33        27     sunny
3  04-01-2025  hyderbad           34        29    cloudy
4  05-01-2025  hyderbad           33        33     rainy

In [43]:
df.tail()

         date       city  temperature  humidity condition
5  06-01-2025  bangalore           28        32     rainy
6  07-01-2025  bangalore           32        29     sunny
7  08-01-2025  bangalore           29        29    cloudy
8  09-01-2025  bangalore           31        31     rainy
9  10-01-2025  bangalore           28        32    sunnyu

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         10 non-null     object
 1   city         10 non-null     object
 2   temperature  10 non-null     int64
 3   humidity     10 non-null     int64
 4   condition    10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [47]:
df['date'] [df['condition']=='rainy']

4    05-01-2025
5    06-01-2025
8    09-01-2025
Name: date, dtype: object

In [48]:
df[2:5]

         date      city  temperature  humidity condition
2  03-01-2025  hyderbad           33        27     sunny
3  04-01-2025  hyderbad           34        29    cloudy
4  05-01-2025  hyderbad           33        33     rainy

In [49]:
df.columns

Index(['date', 'city', 'temperature', 'humidity', 'condition'], dtype='object')

In [50]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [51]:
df.dtypes

date           object
city           object
temperature     int64
humidity        int64
condition      object
dtype: object

In [52]:
df.date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: date, dtype: object

In [53]:
df.city

0     hyderbad
1     hyderbad
2     hyderbad
3     hyderbad
4     hyderbad
5    bangalore
6    bangalore
7    bangalore
8    bangalore
9    bangalore
Name: city, dtype: object

In [54]:
df[['date','condition']]

         date condition
0  01-01-2025     sunny
1  02-01-2025      cold
2  03-01-2025     sunny
3  04-01-2025    cloudy
4  05-01-2025     rainy
5  06-01-2025     rainy
6  07-01-2025     sunny
7  08-01-2025    cloudy
8  09-01-2025     rainy
9  10-01-2025    sunnyu

missing value

In [55]:
df.isnull()

    date   city  temperature  humidity  condition
0  False  False        False     False      False
1  False  False        False     False      False
2  False  False        False     False      False
3  False  False        False     False      False
4  False  False        False     False      False
5  False  False        False     False      False
6  False  False        False     False      False
7  False  False        False     False      False
8  False  False        False     False      False
9  False  False        False     False      False

In [68]:
df = pd.DataFrame({
    "name":["pavan","vinay","deeven"],
    "age":[25,23,None]
    })
df

     name   age
0   pavan  25.0
1   vinay  23.0
2  deeven   NaN

In [60]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [61]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [62]:
df[df.isnull().any(axis=1)]

     name  age
2  deeven  NaN

In [63]:
df['age']=df['age'].fillna(df['age'].mean())

In [65]:
df

     name   age
0   pavan  25.0
1   vinay  23.0
2  deeven  24.0

In [69]:
df_clean=df.dropna()
df_clean

    name   age
0  pavan  25.0
1  vinay  23.0

###Duplicates

In [84]:
df = pd.DataFrame({
    "name":["pavan","vinay","pavan"],
    "age":[25,23,25]
    })
df

    name  age
0  pavan   25
1  vinay   23
2  pavan   25

In [85]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [86]:
df[df.duplicated()]

    name  age
2  pavan   25

In [87]:
df = df.drop_duplicates()

In [88]:
df

    name  age
0  pavan   25
1  vinay   23